Revit 2024 API
TopRail Class
 Represents a top rail element in Autodesk Revit.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class TopRail : ContinuousRail
Visual Basic
Public Class TopRail _
	Inherits ContinuousRail
Visual C++
public ref class TopRail : public ContinuousRail
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Architecture.ContinuousRail
 Autodesk.Revit.DB.Architecture.TopRail
See Also
TopRail Members
Autodesk.Revit.DB.Architecture Namespace